{"format": "layers-model", "generatedBy": "keras v2.2.5", "convertedBy": "TensorFlow.js Converter v1.5.2", "modelTopology": {"keras_version": "2.2.5", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_37", "layers": [{"name": "input_37", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "input_37"}, "inbound_nodes": []}, {"name": "sequential_30", "class_name": "Sequential", "config": {"name": "sequential_30", "layers": [{"class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "batch_input_shape": [null, 4], "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_21", "trainable": true, "dtype": "float32", "target_shape": [2, 2, 128]}}, {"class_name": "Activation", "config": {"name": "activation_78", "trainable": true, "dtype": "float32", "activation": "tanh"}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_58", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_53", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_91", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_79", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_59", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_54", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_92", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_80", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_60", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_55", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_93", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_81", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_56", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "Activation", "config": {"name": "activation_82", "trainable": true, "dtype": "float32", "activation": "tanh"}}]}, "inbound_nodes": [[["input_37", 0, 0, {}]]]}], "input_layers": [["input_37", 0, 0]], "output_layers": [["sequential_30", 1, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_30/kernel", "shape": [4, 512], "dtype": "float32"}, {"name": "dense_30/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_53/kernel", "shape": [4, 4, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_53/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_91/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_91/beta", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_54/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_transpose_54/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_92/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_92/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_55/kernel", "shape": [2, 2, 32, 64], "dtype": "float32"}, {"name": "conv2d_transpose_55/bias", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_93/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_93/beta", "shape": [32], "dtype": "float32"}, {"name": "conv2d_transpose_56/kernel", "shape": [1, 1, 3, 32], "dtype": "float32"}, {"name": "conv2d_transpose_56/bias", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_91/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_91/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_92/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_92/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_93/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_93/moving_variance", "shape": [32], "dtype": "float32"}]}]}