{"format": "layers-model", "generatedBy": "keras v2.2.5", "convertedBy": "TensorFlow.js Converter v1.5.2", "modelTopology": {"keras_version": "2.2.5", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_75", "layers": [{"name": "input_75", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "input_75"}, "inbound_nodes": []}, {"name": "sequential_61", "class_name": "Sequential", "config": {"name": "sequential_61", "layers": [{"class_name": "Dense", "config": {"name": "dense_61", "trainable": true, "batch_input_shape": [null, 4], "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_45", "trainable": true, "dtype": "float32", "target_shape": [2, 2, 128]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_234", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_220", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.5, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_92", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_114", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_235", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_221", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.5, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_93", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_115", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_236", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_222", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.5, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_94", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_116", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_237", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_223", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.5, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_188", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_238", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_189", "trainable": true, "dtype": "float32", "activation": "tanh"}}]}, "inbound_nodes": [[["input_75", 0, 0, {}]]]}], "input_layers": [["input_75", 0, 0]], "output_layers": [["sequential_61", 1, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_61/kernel", "shape": [4, 512], "dtype": "float32"}, {"name": "dense_61/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_234/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_234/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_220/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_220/beta", "shape": [128], "dtype": "float32"}, {"name": "conv2d_235/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_235/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_221/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_221/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2d_236/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv2d_236/bias", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_222/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_222/beta", "shape": [32], "dtype": "float32"}, {"name": "conv2d_237/kernel", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "conv2d_237/bias", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_223/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_223/beta", "shape": [16], "dtype": "float32"}, {"name": "conv2d_238/kernel", "shape": [3, 3, 16, 3], "dtype": "float32"}, {"name": "conv2d_238/bias", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_220/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_220/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_221/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_221/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_222/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_222/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_223/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_223/moving_variance", "shape": [16], "dtype": "float32"}]}]}